"""Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с
повторениями). Выдать без повторений в порядке возрастания все те числа, которые
встречаются в обоих наборах.
Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
элементов второго множества. Затем пользователь вводит сами элементы множеств."""

n, m = input("Введите количество элементов множеств 1 и 2 через пробел: ").split()
n, m = int(n), int(m)
set1 = set()
set2 = set()
print("Введите элементы первого множества через пробел:")
for i in input().split():
    set1.add(int(i))
print("Введите элементы второго множества через пробел:")
for i in input().split():
    set2.add(int(i))
equal_elements = sorted(set1.intersection(set2))
print("Общие элементы в порядке возрастания:", *equal_elements)

"""Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности.
Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и
нескольких собирающих модулей.
Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
находясь перед некоторым кустом заданной во входном файле грядки."""

n = int(input("Сколько кустов: "))
berries = []
for _ in range(n):
    berry_count = int(input("Сколько ягод на кусте "))
    berries.append(berry_count)
max_berries = 0
for i in range(n):
    collected = berries[i] + berries[(i + 1) % n] + berries[(i + 2) % n]
    max_berries = max(max_berries, collected)
print("Максимум ягод, можно собрать за один заход:", max_berries)
